InformationRegisters/упРасстоянияМеждуТочками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упРасстоянияМеждуТочками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяБазовое</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВоскресенье</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВторник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПонедельник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПятница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСреда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяСуббота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЧетверг</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьПростой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвтоматическийРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопыткаРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПытатьсяРассчитатьСнова</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НачальнаяШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачальнаяДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечнаяШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонечнаяДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ограничение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОграниченияМаршрутизаторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упЗональныеНастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упЗональныеНастройкиМаршрутизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Граница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентДоГраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентПослеГраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗонаОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗонаПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упИерархияГеографическихЗон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИерархияГеографическихЗон</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упТипыМаршрутизаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыМаршрутизаторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AxelotMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Graphhopper</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleMaps</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СитиГИД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМаршрутизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упГеографическиеЗоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГеографическиеЗоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Nominatim_place_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>osm_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоны</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляУчетаМестоположений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДолгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинШирота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроходитЧерез180Меридиан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьПопарныеРасстоянияМеждуТочкамиЗоны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьРасстоянияСУчетомДополнительныхОграниченийСитиГИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиПолигонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полигон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолигонПростой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упРасстоянияМеждуТочками/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Не ОбменДанными.Загрузка Тогда
		текДата = ТекущаяДата();
		ТипМаршрутизатора = Константы.упТипМаршрутизатора.Получить();
		УчитыватьКоэффициентыРасчетаВремениВПути = ПолучитьФункциональнуюОпцию("упУчитыватьКоэффициентыРасчетаВремениВПути");
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл 
			СтрокаНабора.ДатаИзменения = текДата;
			Если Истина
				И СтрокаНабора.ПытатьсяРассчитатьСнова 
				И (СтрокаНабора.ПопыткаРасчета >= 10 Или СтрокаНабора.ПопыткаРасчета = 0) 
			Тогда
				СтрокаНабора.ПытатьсяРассчитатьСнова = Ложь;
			КонецЕсли; 
			Если Истина
				И УчитыватьКоэффициентыРасчетаВремениВПути
				И (Ложь
					Или ТипМаршрутизатора = Перечисления.упТипыМаршрутизаторов.Graphhopper 
					Или ТипМаршрутизатора = Перечисления.упТипыМаршрутизаторов.AxelotMaps)
			Тогда
				РассчитатьВремяПутиПоЗональнымКоэффициентам(СтрокаНабора);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

Процедура РассчитатьВремяПутиПоЗональнымКоэффициентам(СтрокаНабораЗаписейРасстояний) Экспорт 
	
	Если Ложь Тогда // Для контекстной подсказки
	    СтрокаНабораЗаписейРасстояний = РегистрыСведений.упРасстоянияМеждуТочками.СоздатьНаборЗаписей().Добавить();
	КонецЕсли;
	Если СтрокаНабораЗаписейРасстояний.Время = 0 Тогда
		Возврат;
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "
|//{Запрос: 0 ////////////////////////////////////////
|ВЫБРАТЬ
|	ЗональныеНастройки.Граница КАК Граница,
|	ЗональныеНастройки.КоэффициентДоГраницы КАК КоэффициентДоГраницы,
|	ЗональныеНастройки.КоэффициентПослеГраницы КАК КоэффициентПослеГраницы,
|	ИерархияОтправления.Родитель КАК РодительОтправления,
|	ИерархияОтправления.Уровень КАК УровеньОтправления,
|	ИерархияПолучения.Родитель КАК РодительПолучения,
|	ИерархияПолучения.Уровень КАК УровеньПолучения
|ПОМЕСТИТЬ ПодходящииеЗональныеНастройки
|ИЗ
|	РегистрСведений.упЗональныеНастройкиМаршрутизации КАК ЗональныеНастройки
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упИерархияГеографическихЗон КАК ИерархияОтправления
|	ПО ИерархияОтправления.Родитель = ЗональныеНастройки.ЗонаОтправления
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упАдреса КАК АдресОтправления
|	ПО ИерархияОтправления.Зона = АдресОтправления.ГеографическаяЗона
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упИерархияГеографическихЗон КАК ИерархияПолучения
|	ПО ИерархияОтправления.Родитель = ЗональныеНастройки.ЗонаОтправления
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упАдреса КАК АдресПолучения
|	ПО ИерархияПолучения.Зона = АдресПолучения.ГеографическаяЗона
|ГДЕ ИСТИНА
|	И АдресОтправления.Широта = &НачальнаяШирота
|	И АдресОтправления.Долгота = &НачальнаяДолгота
|	И АдресПолучения.Долгота = &КонечнаяДолгота
|	И АдресПолучения.Широта = &КонечнаяШирота
|ОБЪЕДИНИТЬ ВСЕ
|ВЫБРАТЬ
|	упЗональныеНастройкиМаршрутизацииТ.Граница КАК Граница,
|	упЗональныеНастройкиМаршрутизацииТ.КоэффициентДоГраницы КАК КоэффициентДоГраницы,
|	упЗональныеНастройкиМаршрутизацииТ.КоэффициентПослеГраницы КАК КоэффициентПослеГраницы,
|	упЗональныеНастройкиМаршрутизацииТ.ЗонаОтправления КАК РодительОтправления,
|	-1 КАК УровеньОтправления,
|	упЗональныеНастройкиМаршрутизацииТ.ЗонаПолучения КАК РодительПолучения,
|	-1 КАК УровеньПолучения
|ИЗ
|	РегистрСведений.упЗональныеНастройкиМаршрутизации КАК упЗональныеНастройкиМаршрутизацииТ
|ГДЕ ИСТИНА
|	И упЗональныеНастройкиМаршрутизацииТ.ЗонаОтправления = ЗНАЧЕНИЕ(Справочник.упГеографическиеЗоны.ПустаяСсылка)
|	И упЗональныеНастройкиМаршрутизацииТ.ЗонаПолучения = ЗНАЧЕНИЕ(Справочник.упГеографическиеЗоны.ПустаяСсылка)
|
|
|;
|//{Запрос: 1 ////////////////////////////////////////
|ВЫБРАТЬ
|	МАКСИМУМ(ПодходящииеЗональныеНастройкиТ.УровеньОтправления) КАК УровеньОтправления
|ПОМЕСТИТЬ МаксимальныйУровеньОтправления
|ИЗ
|	ПодходящииеЗональныеНастройки КАК ПодходящииеЗональныеНастройкиТ
|;
|//{Запрос: 2 ////////////////////////////////////////
|ВЫБРАТЬ
|	МАКСИМУМ(ПодходящииеЗональныеНастройкиТ.УровеньПолучения) КАК УровеньПолучения
|ПОМЕСТИТЬ МаксимальныйУровеньПолучения
|ИЗ
|	МаксимальныйУровеньОтправления КАК МаксимальныйУровеньОтправленияТ
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящииеЗональныеНастройки КАК ПодходящииеЗональныеНастройкиТ
|	ПО ИСТИНА
|;
|//{Запрос: 3 ////////////////////////////////////////
|ВЫБРАТЬ
|	ПодходящииеЗональныеНастройкиТ.Граница КАК Граница,
|	ПодходящииеЗональныеНастройкиТ.КоэффициентДоГраницы КАК КоэффициентДоГраницы,
|	ПодходящииеЗональныеНастройкиТ.КоэффициентПослеГраницы КАК КоэффициентПослеГраницы
|ИЗ
|	ПодходящииеЗональныеНастройки КАК ПодходящииеЗональныеНастройкиТ
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйУровеньОтправления КАК МаксимальныйУровеньОтправленияТ
|	ПО ПодходящииеЗональныеНастройкиТ.УровеньОтправления = МаксимальныйУровеньОтправленияТ.УровеньОтправления
|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйУровеньПолучения КАК МаксимальныйУровеньПолученияТ
|	ПО ПодходящииеЗональныеНастройкиТ.УровеньПолучения = МаксимальныйУровеньПолученияТ.УровеньПолучения
	|";
	Запрос.УстановитьПараметр("НачальнаяШирота", СтрокаНабораЗаписейРасстояний.НачальнаяШирота);
	Запрос.УстановитьПараметр("НачальнаяДолгота", СтрокаНабораЗаписейРасстояний.НачальнаяДолгота);
	Запрос.УстановитьПараметр("КонечнаяШирота", СтрокаНабораЗаписейРасстояний.КонечнаяШирота);
	Запрос.УстановитьПараметр("КонечнаяДолгота", СтрокаНабораЗаписейРасстояний.КонечнаяДолгота);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультата.Количество() = 0 Тогда
		ВызватьИсключение "В регистре зональных настроек маршрутизации отсутствует строка с пустыми зонами";
	КонецЕсли; 
	ЗональныеКоэффициенты = ТаблицаРезультата[0];
	Если Ложь Тогда // Для контекстной подсказки
	    ЗональныеКоэффициенты = РегистрыСведений.упЗональныеНастройкиМаршрутизации.СоздатьНаборЗаписей().Добавить();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаНабораЗаписейРасстояний.ВремяБазовое) Тогда
		СтрокаНабораЗаписейРасстояний.ВремяБазовое = СтрокаНабораЗаписейРасстояний.Время;
	КонецЕсли; 
	Если СтрокаНабораЗаписейРасстояний.ВремяБазовое = 0 Тогда
		Скорость = 0;
	Иначе
		Скорость = СтрокаНабораЗаписейРасстояний.Расстояние / СтрокаНабораЗаписейРасстояний.ВремяБазовое;
	КонецЕсли; 
	ПерваяПоловинаПути = Мин(ЗональныеКоэффициенты.Граница, СтрокаНабораЗаписейРасстояний.Расстояние);
	ВтораяПоловинаПути = СтрокаНабораЗаписейРасстояний.Расстояние - ПерваяПоловинаПути;
	Если Скорость * ЗональныеКоэффициенты.КоэффициентПослеГраницы = 0 Тогда
		ВремяНовое = 0;
	Иначе
		ВремяНовое = ПерваяПоловинаПути * ЗональныеКоэффициенты.КоэффициентДоГраницы / Скорость + ЗональныеКоэффициенты.КоэффициентПослеГраницы * ВтораяПоловинаПути / Скорость;
	КонецЕсли; 
	СтрокаНабораЗаписейРасстояний.Время = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяВоскресенье = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяВторник = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяПонедельник = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяПятница = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяСреда = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяСуббота = ВремяНовое;
	СтрокаНабораЗаписейРасстояний.ВремяЧетверг = ВремяНовое;

КонецПроцедуры

#КонецОбласти
